# GroupBy Mechanics

In [1]:
#rows(axis=0) and column(axis=1)
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [5]:
df = DataFrame({'key1':['a','a','b','b','a'],'key2':['one','two','one','two','one'],'data1':np.random.randn(5),'data2':np.random.randn(5)})
df

      data1     data2 key1 key2
0  0.124734  0.225007    a  one
1 -0.716090  0.872185    a  two
2 -1.342068  0.158098    b  one
3  0.353907 -1.143855    b  two
4  1.099746  0.409517    a  one

In [14]:
#to compute the mean of the data1 column using the group labels from key1

In [16]:
grouped = df['data1'].groupby(df['key1'])
grouped #the grouped variable is a group by object

In [17]:
grouped.mean()

key1
a    0.667273
b    0.180570
Name: data1, dtype: float64

In [18]:
#passing multiple arrays as a list

In [19]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [20]:
means

key1  key2
a     one     1.115611
      two    -0.229403
b     one    -1.271214
      two     1.632354
Name: data1, dtype: float64

In [21]:
means.unstack()

key2       one       two
key1
a     1.115611 -0.229403
b    -1.271214  1.632354

In [22]:
#the group keys are Series and they could be any arrays of the right length

In [24]:
states = np.array(['Ohio','California','California','Ohio','Ohio'])
years = np.array([2005,2005,2006,2005,2006])
df['data1'].groupby([states,years]).mean()

California  2005   -0.229403
            2006   -1.271214
Ohio        2005    1.399882
            2006    1.063813
Name: data1, dtype: float64

In [25]:
#pass columns names as group keys

In [26]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.667273  0.315857
b     0.180570  0.440091

In [27]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   1.115611 -0.226710
     two  -0.229403  1.400989
b    one  -1.271214  1.020517
     two   1.632354 -0.140334

In [28]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

# Iterating over Groups

In [30]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  1.167409 -1.396789    a  one
1 -0.229403  1.400989    a  two
4  1.063813  0.943370    a  one
b
      data1     data2 key1 key2
2 -1.271214  1.020517    b  one
3  1.632354 -0.140334    b  two

In [31]:
#In case of multiple keys
for (k1,k2),group in df.groupby(['key1','key2']):
    print (k1,k2)
    print (group)

a one
      data1     data2 key1 key2
0  1.167409 -1.396789    a  one
4  1.063813  0.943370    a  one
a two
      data1     data2 key1 key2
1 -0.229403  1.400989    a  two
b one
      data1     data2 key1 key2
2 -1.271214  1.020517    b  one
b two
      data1     data2 key1 key2
3  1.632354 -0.140334    b  two

In [32]:
#computing a dict of the data pieces as a one liner

In [36]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

      data1     data2 key1 key2
2 -1.271214  1.020517    b  one
3  1.632354 -0.140334    b  two

In [39]:
#By default group by groups on axis=0,but we can group on any other axes.group the columns by dtype:

In [40]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [44]:
df

      data1     data2 key1 key2
0  1.167409 -1.396789    a  one
1 -0.229403  1.400989    a  two
2 -1.271214  1.020517    b  one
3  1.632354 -0.140334    b  two
4  1.063813  0.943370    a  one

In [49]:
grouped=df.groupby(df.dtypes,axis=1)

In [50]:
for i,j in grouped:
    print(i)
    print(j)

float64
      data1     data2
0  1.167409 -1.396789
1 -0.229403  1.400989
2 -1.271214  1.020517
3  1.632354 -0.140334
4  1.063813  0.943370
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

# Selecting a column or subset of columns

In [52]:
df['key1']

0    a
1    a
2    b
3    b
4    a
Name: key1, dtype: object

In [53]:
df[['key1']]

  key1
0    a
1    a
2    b
3    b
4    a

In [56]:
#df.groupby('key1')['data1'] is same as df['data1'].groupby(df['key1])
#df.groupby('key1')[['data2']] is same as df[['data2']].groupby(df['key1])

In [58]:
#compute means for the data2 column and get the result as a dataframe
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.226710
     two   1.400989
b    one   1.020517
     two  -0.140334

In [59]:
s_grouped = df.groupby(['key1','key2'])['data2']
s_grouped

In [60]:
s_grouped.mean()

key1  key2
a     one    -0.226710
      two     1.400989
b     one     1.020517
      two    -0.140334
Name: data2, dtype: float64

# Grouping with Dicts and Series

In [14]:
people =DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],index=['Joe','Steve','Wes','Jim','Travis'])

In [4]:
people.ix[2:3,['b','c']]=np.nan #add a few NA values

In [5]:
people

               a         b         c         d         e
Joe    -1.247329  0.036886 -2.168899  0.690024 -0.890311
Steve   0.166922  1.095712  0.514363 -0.417773 -2.311431
Wes    -0.989125       NaN       NaN -1.037329  0.764895
Jim    -0.742987 -0.419882 -0.243866 -1.878199  0.890531
Travis -0.599328  2.709177  0.704749 -1.710326 -0.403264

In [6]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [7]:
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [8]:
by_column = people.groupby(mapping,axis=1)

In [10]:
for i,j in by_column:
    print(i)
    print(j)

blue
               c         d
Joe    -2.168899  0.690024
Steve   0.514363 -0.417773
Wes          NaN -1.037329
Jim    -0.243866 -1.878199
Travis  0.704749 -1.710326
red
               a         b         e
Joe    -1.247329  0.036886 -0.890311
Steve   0.166922  1.095712 -2.311431
Wes    -0.989125       NaN  0.764895
Jim    -0.742987 -0.419882  0.890531
Travis -0.599328  2.709177 -0.403264

In [11]:
by_column.sum()

            blue       red
Joe    -1.478875 -2.100755
Steve   0.096590 -1.048796
Wes    -1.037329 -0.224229
Jim    -2.122065 -0.272339
Travis -1.005578  1.706585

In [12]:
map_series = Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [13]:
people.groupby(map_series,axis = 1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

# Grouping with functions

In [15]:
#want to groupby length of string of names

In [18]:
people.groupby(len).sum()

          a         b         c         d         e
3 -2.979441 -0.382997 -2.412765 -2.225504  0.765115
5  0.166922  1.095712  0.514363 -0.417773 -2.311431
6 -0.599328  2.709177  0.704749 -1.710326 -0.403264

In [20]:
#mixing functions with arrays,dicts or Series

In [21]:
key_list = ['one','one','one','two','two']

In [22]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -1.247329  0.036886 -2.168899 -1.037329 -0.890311
  two -0.742987 -0.419882 -0.243866 -1.878199  0.890531
5 one  0.166922  1.095712  0.514363 -0.417773 -2.311431
6 two -0.599328  2.709177  0.704749 -1.710326 -0.403264

In [23]:
for i,j in people.groupby([len,key_list]):
    print(i)
    print(j)

(3, 'one')
            a         b         c         d         e
Joe -1.247329  0.036886 -2.168899  0.690024 -0.890311
Wes -0.989125       NaN       NaN -1.037329  0.764895
(3, 'two')
            a         b         c         d         e
Jim -0.742987 -0.419882 -0.243866 -1.878199  0.890531
(5, 'one')
              a         b         c         d         e
Steve  0.166922  1.095712  0.514363 -0.417773 -2.311431
(6, 'two')
               a         b         c         d         e
Travis -0.599328  2.709177  0.704749 -1.710326 -0.403264

# Grouping by Index levels

In [26]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['cty','tenor'])

In [27]:
hier_df = DataFrame(np.random.randn(4,5),columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.022978  0.627406 -1.151486 -1.561882  0.488814
1     -0.756904 -1.141272  0.197162 -2.134256  1.792771
2      0.266621 -2.798367  0.682079  1.543748  0.965586
3     -1.286612 -0.933729 -0.317464  0.111730 -1.045842

In [28]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

# DATA Aggretation

In [30]:
df

      data1     data2 key1 key2
0 -0.343521  2.464304    a  one
1 -0.496838  0.725268    a  two
2  1.275171 -0.993779    b  one
3  1.868629  0.353953    b  two
4  3.225798 -1.024886    a  one

In [31]:
#To compute statistical measures in columns

In [32]:
grouped = df.groupby('key1')

In [33]:
grouped['data1'].quantile(0.9)

key1
a    2.511935
b    1.809283
Name: data1, dtype: float64

In [34]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [35]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     3.722637  3.489190
b     0.593458  1.347732

In [36]:
grouped.describe()

               data1     data2
key1
a    count  3.000000  3.000000
     mean   0.795146  0.721562
     std    2.106402  1.744598
     min   -0.496838 -1.024886
     25%   -0.420180 -0.149809
     50%   -0.343521  0.725268
     75%    1.441139  1.594786
     max    3.225798  2.464304
b    count  2.000000  2.000000
     mean   1.571900 -0.319913
     std    0.419638  0.952991
     min    1.275171 -0.993779
     25%    1.423535 -0.656846
     50%    1.571900 -0.319913
     75%    1.720265  0.017020
     max    1.868629  0.353953

In [30]:
tips=pd.read_csv('C:/Users/HP/Desktop/tips.csv')

In [41]:
tips.ix[:5,:]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4

In [42]:
#Add tip percentage of total bill

In [40]:
tips['tip_pct'] = tips['tip']/tips['total_bill']

In [30]:
tips.ix[:5,:]

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808
5       25.29  4.71    Male     No  Sun  Dinner     4  0.186240

# Column wise and Multiple function Application

In [45]:
grouped = tips.groupby(['sex','smoker'])

In [46]:
for i,j in grouped:
    print(i)
    print(j)

('Female', 'No')
     total_bill   tip     sex smoker   day    time  size   tip_pct
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
11        35.26  5.00  Female     No   Sun  Dinner     4  0.141804
14        14.83  3.02  Female     No   Sun  Dinner     2  0.203641
16        10.33  1.67  Female     No   Sun  Dinner     3  0.161665
18        16.97  3.50  Female     No   Sun  Dinner     3  0.206246
21        20.29  2.75  Female     No   Sat  Dinner     2  0.135535
22        15.77  2.23  Female     No   Sat  Dinner     2  0.141408
29        19.65  3.00  Female     No   Sat  Dinner     2  0.152672
32        15.06  3.00  Female     No   Sat  Dinner     2  0.199203
33        20.69  2.45  Female     No   Sat  Dinner     4  0.118415
37        16.93  3.07  Female     No   Sat  Dinner     3  0.181335
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
52        34.81  5.20  Female     No   Sun  Dinner     4  0.149382
57        26.41  1.50  Female     No   Sat  Dinner     2  0.056797
66        16.45  2.47  Female     No   Sat  Dinner     2  0.150152
71        17.07  3.00  Female     No   Sat  Dinner     3  0.175747
74        14.73  2.20  Female     No   Sat  Dinner     2  0.149355
82        10.07  1.83  Female     No  Thur   Lunch     1  0.181728
85        34.83  5.17  Female     No  Thur   Lunch     4  0.148435
94        22.75  3.25  Female     No   Fri  Dinner     2  0.142857
104       20.92  4.08  Female     No   Sat  Dinner     2  0.195029
111        7.25  1.00  Female     No   Sat  Dinner     1  0.137931
114       25.71  4.00  Female     No   Sun  Dinner     3  0.155581
115       17.31  3.50  Female     No   Sun  Dinner     2  0.202195
117       10.65  1.50  Female     No  Thur   Lunch     2  0.140845
118       12.43  1.80  Female     No  Thur   Lunch     2  0.144811
119       24.08  2.92  Female     No  Thur   Lunch     4  0.121262
121       13.42  1.68  Female     No  Thur   Lunch     2  0.125186
124       12.48  2.52  Female     No  Thur   Lunch     2  0.201923
125       29.80  4.20  Female     No  Thur   Lunch     6  0.140940
127       14.52  2.00  Female     No  Thur   Lunch     2  0.137741
128       11.38  2.00  Female     No  Thur   Lunch     2  0.175747
131       20.27  2.83  Female     No  Thur   Lunch     2  0.139615
132       11.17  1.50  Female     No  Thur   Lunch     2  0.134288
133       12.26  2.00  Female     No  Thur   Lunch     2  0.163132
134       18.26  3.25  Female     No  Thur   Lunch     2  0.177985
135        8.51  1.25  Female     No  Thur   Lunch     2  0.146886
136       10.33  2.00  Female     No  Thur   Lunch     2  0.193611
137       14.15  2.00  Female     No  Thur   Lunch     2  0.141343
139       13.16  2.75  Female     No  Thur   Lunch     2  0.208967
140       17.47  3.50  Female     No  Thur   Lunch     2  0.200343
143       27.05  5.00  Female     No  Thur   Lunch     6  0.184843
144       16.43  2.30  Female     No  Thur   Lunch     2  0.139988
145        8.35  1.50  Female     No  Thur   Lunch     2  0.179641
146       18.64  1.36  Female     No  Thur   Lunch     3  0.072961
147       11.87  1.63  Female     No  Thur   Lunch     2  0.137321
155       29.85  5.14  Female     No   Sun  Dinner     5  0.172194
157       25.00  3.75  Female     No   Sun  Dinner     4  0.150000
158       13.39  2.61  Female     No   Sun  Dinner     2  0.194922
162       16.21  2.00  Female     No   Sun  Dinner     3  0.123381
223       15.98  3.00  Female     No   Fri   Lunch     3  0.187735
238       35.83  4.67  Female     No   Sat  Dinner     3  0.130338
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744
('Female', 'Yes')
     total_bill   tip     sex smoker   day    time  size   tip_pct
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
72        26.86  3.14  Female    Yes   Sat  Dinner     2  0.116902
73        25.28  5.00  Female    Yes   Sat  Dinner     2  0.197785
92         5.75  1.00  Female    Yes   Fri  Dinner     2  0.173913
93        16.32  4.30  Female    Yes   Fri  Dinner     2  0.263480
100       11.35  2.50  Female    Yes   Fri  Dinner     2  0.220264
101       15.38  3.00  Female    Yes   Fri  Dinner     2  0.195059
102       44.30  2.50  Female    Yes   Sat  Dinner     3  0.056433
103       22.42  3.48  Female    Yes   Sat  Dinner     2  0.155219
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
164       17.51  3.00  Female    Yes   Sun  Dinner     2  0.171331
168       10.59  1.61  Female    Yes   Sat  Dinner     2  0.152030
169       10.63  2.00  Female    Yes   Sat  Dinner     2  0.188147
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
186       20.90  3.50  Female    Yes   Sun  Dinner     3  0.167464
188       18.15  3.50  Female    Yes   Sun  Dinner     3  0.192837
191       19.81  4.19  Female    Yes  Thur   Lunch     2  0.211509
197       43.11  5.00  Female    Yes  Thur   Lunch     4  0.115982
198       13.00  2.00  Female    Yes  Thur   Lunch     2  0.153846
201       12.74  2.01  Female    Yes  Thur   Lunch     2  0.157771
202       13.00  2.00  Female    Yes  Thur   Lunch     2  0.153846
203       16.40  2.50  Female    Yes  Thur   Lunch     2  0.152439
205       16.47  3.23  Female    Yes  Thur   Lunch     3  0.196114
209       12.76  2.23  Female    Yes   Sat  Dinner     2  0.174765
213       13.27  2.50  Female    Yes   Sat  Dinner     2  0.188395
214       28.17  6.50  Female    Yes   Sat  Dinner     3  0.230742
215       12.90  1.10  Female    Yes   Sat  Dinner     2  0.085271
219       30.14  3.09  Female    Yes   Sat  Dinner     4  0.102522
221       13.42  3.48  Female    Yes   Fri   Lunch     2  0.259314
225       16.27  2.50  Female    Yes   Fri   Lunch     2  0.153657
226       10.09  2.00  Female    Yes   Fri   Lunch     2  0.198216
229       22.12  2.88  Female    Yes   Sat  Dinner     2  0.130199
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
('Male', 'No')
     total_bill   tip   sex smoker   day    time  size   tip_pct
1         10.34  1.66  Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50  Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31  Male     No   Sun  Dinner     2  0.139780
5         25.29  4.71  Male     No   Sun  Dinner     4  0.186240
6          8.77  2.00  Male     No   Sun  Dinner     2  0.228050
7         26.88  3.12  Male     No   Sun  Dinner     4  0.116071
8         15.04  1.96  Male     No   Sun  Dinner     2  0.130319
9         14.78  3.23  Male     No   Sun  Dinner     2  0.218539
10        10.27  1.71  Male     No   Sun  Dinner     2  0.166504
12        15.42  1.57  Male     No   Sun  Dinner     2  0.101816
13        18.43  3.00  Male     No   Sun  Dinner     4  0.162778
15        21.58  3.92  Male     No   Sun  Dinner     2  0.181650
17        16.29  3.71  Male     No   Sun  Dinner     3  0.227747
19        20.65  3.35  Male     No   Sat  Dinner     3  0.162228
20        17.92  4.08  Male     No   Sat  Dinner     2  0.227679
23        39.42  7.58  Male     No   Sat  Dinner     4  0.192288
24        19.82  3.18  Male     No   Sat  Dinner     2  0.160444
25        17.81  2.34  Male     No   Sat  Dinner     4  0.131387
26        13.37  2.00  Male     No   Sat  Dinner     2  0.149589
27        12.69  2.00  Male     No   Sat  Dinner     2  0.157604
28        21.70  4.30  Male     No   Sat  Dinner     2  0.198157
30         9.55  1.45  Male     No   Sat  Dinner     2  0.151832
31        18.35  2.50  Male     No   Sat  Dinner     4  0.136240
34        17.78  3.27  Male     No   Sat  Dinner     2  0.183915
35        24.06  3.60  Male     No   Sat  Dinner     3  0.149626
36        16.31  2.00  Male     No   Sat  Dinner     3  0.122624
38        18.69  2.31  Male     No   Sat  Dinner     3  0.123596
39        31.27  5.00  Male     No   Sat  Dinner     3  0.159898
40        16.04  2.24  Male     No   Sat  Dinner     3  0.139651
41        17.46  2.54  Male     No   Sun  Dinner     2  0.145475
..          ...   ...   ...    ...   ...     ...   ...       ...
126        8.52  1.48  Male     No  Thur   Lunch     2  0.173709
129       22.82  2.18  Male     No  Thur   Lunch     3  0.095530
130       19.08  1.50  Male     No  Thur   Lunch     2  0.078616
141       34.30  6.70  Male     No  Thur   Lunch     6  0.195335
142       41.19  5.00  Male     No  Thur   Lunch     5  0.121389
148        9.78  1.73  Male     No  Thur   Lunch     2  0.176892
149        7.51  2.00  Male     No  Thur   Lunch     2  0.266312
150       14.07  2.50  Male     No   Sun  Dinner     2  0.177683
151       13.13  2.00  Male     No   Sun  Dinner     2  0.152323
152       17.26  2.74  Male     No   Sun  Dinner     3  0.158749
153       24.55  2.00  Male     No   Sun  Dinner     4  0.081466
154       19.77  2.00  Male     No   Sun  Dinner     4  0.101163
156       48.17  5.00  Male     No   Sun  Dinner     6  0.103799
159       16.49  2.00  Male     No   Sun  Dinner     4  0.121286
160       21.50  3.50  Male     No   Sun  Dinner     4  0.162791
161       12.66  2.50  Male     No   Sun  Dinner     2  0.197472
163       13.81  2.00  Male     No   Sun  Dinner     2  0.144823
165       24.52  3.48  Male     No   Sun  Dinner     3  0.141925
166       20.76  2.24  Male     No   Sun  Dinner     2  0.107900
167       31.71  4.50  Male     No   Sun  Dinner     4  0.141911
185       20.69  5.00  Male     No   Sun  Dinner     5  0.241663
195        7.56  1.44  Male     No  Thur   Lunch     2  0.190476
212       48.33  9.00  Male     No   Sat  Dinner     4  0.186220
227       20.45  3.00  Male     No   Sat  Dinner     4  0.146699
228       13.28  2.72  Male     No   Sat  Dinner     2  0.204819
232       11.61  3.39  Male     No   Sat  Dinner     2  0.291990
233       10.77  1.47  Male     No   Sat  Dinner     2  0.136490
235       10.07  1.25  Male     No   Sat  Dinner     2  0.124131
239       29.03  5.92  Male     No   Sat  Dinner     3  0.203927
242       17.82  1.75  Male     No   Sat  Dinner     2  0.098204

[97 rows x 8 columns]
('Male', 'Yes')
     total_bill    tip   sex smoker   day    time  size   tip_pct
56        38.01   3.00  Male    Yes   Sat  Dinner     4  0.078927
58        11.24   1.76  Male    Yes   Sat  Dinner     2  0.156584
60        20.29   3.21  Male    Yes   Sat  Dinner     2  0.158206
61        13.81   2.00  Male    Yes   Sat  Dinner     2  0.144823
62        11.02   1.98  Male    Yes   Sat  Dinner     2  0.179673
63        18.29   3.76  Male    Yes   Sat  Dinner     4  0.205577
69        15.01   2.09  Male    Yes   Sat  Dinner     2  0.139241
76        17.92   3.08  Male    Yes   Sat  Dinner     2  0.171875
80        19.44   3.00  Male    Yes  Thur   Lunch     2  0.154321
83        32.68   5.00  Male    Yes  Thur   Lunch     2  0.152999
90        28.97   3.00  Male    Yes   Fri  Dinner     2  0.103555
95        40.17   4.73  Male    Yes   Fri  Dinner     4  0.117750
96        27.28   4.00  Male    Yes   Fri  Dinner     2  0.146628
97        12.03   1.50  Male    Yes   Fri  Dinner     2  0.124688
98        21.01   3.00  Male    Yes   Fri  Dinner     2  0.142789
105       15.36   1.64  Male    Yes   Sat  Dinner     2  0.106771
106       20.49   4.06  Male    Yes   Sat  Dinner     2  0.198145
107       25.21   4.29  Male    Yes   Sat  Dinner     2  0.170171
138       16.00   2.00  Male    Yes  Thur   Lunch     2  0.125000
170       50.81  10.00  Male    Yes   Sat  Dinner     3  0.196812
171       15.81   3.16  Male    Yes   Sat  Dinner     2  0.199873
172        7.25   5.15  Male    Yes   Sun  Dinner     2  0.710345
173       31.85   3.18  Male    Yes   Sun  Dinner     2  0.099843
174       16.82   4.00  Male    Yes   Sun  Dinner     2  0.237812
175       32.90   3.11  Male    Yes   Sun  Dinner     2  0.094529
176       17.89   2.00  Male    Yes   Sun  Dinner     2  0.111794
177       14.48   2.00  Male    Yes   Sun  Dinner     2  0.138122
179       34.63   3.55  Male    Yes   Sun  Dinner     2  0.102512
180       34.65   3.68  Male    Yes   Sun  Dinner     4  0.106205
181       23.33   5.65  Male    Yes   Sun  Dinner     2  0.242177
182       45.35   3.50  Male    Yes   Sun  Dinner     3  0.077178
183       23.17   6.50  Male    Yes   Sun  Dinner     4  0.280535
184       40.55   3.00  Male    Yes   Sun  Dinner     2  0.073983
187       30.46   2.00  Male    Yes   Sun  Dinner     5  0.065660
189       23.10   4.00  Male    Yes   Sun  Dinner     3  0.173160
190       15.69   1.50  Male    Yes   Sun  Dinner     2  0.095602
192       28.44   2.56  Male    Yes  Thur   Lunch     2  0.090014
193       15.48   2.02  Male    Yes  Thur   Lunch     2  0.130491
194       16.58   4.00  Male    Yes  Thur   Lunch     2  0.241255
196       10.34   2.00  Male    Yes  Thur   Lunch     2  0.193424
199       13.51   2.00  Male    Yes  Thur   Lunch     2  0.148038
200       18.71   4.00  Male    Yes  Thur   Lunch     3  0.213789
204       20.53   4.00  Male    Yes  Thur   Lunch     4  0.194837
206       26.59   3.41  Male    Yes   Sat  Dinner     3  0.128244
207       38.73   3.00  Male    Yes   Sat  Dinner     4  0.077459
208       24.27   2.03  Male    Yes   Sat  Dinner     2  0.083642
210       30.06   2.00  Male    Yes   Sat  Dinner     3  0.066534
211       25.89   5.16  Male    Yes   Sat  Dinner     4  0.199305
216       28.15   3.00  Male    Yes   Sat  Dinner     5  0.106572
217       11.59   1.50  Male    Yes   Sat  Dinner     2  0.129422
218        7.74   1.44  Male    Yes   Sat  Dinner     2  0.186047
220       12.16   2.20  Male    Yes   Fri   Lunch     2  0.180921
222        8.58   1.92  Male    Yes   Fri   Lunch     1  0.223776
224       13.42   1.58  Male    Yes   Fri   Lunch     2  0.117735
230       24.01   2.00  Male    Yes   Sat  Dinner     4  0.083299
231       15.69   3.00  Male    Yes   Sat  Dinner     3  0.191205
234       15.53   3.00  Male    Yes   Sat  Dinner     2  0.193175
236       12.60   1.00  Male    Yes   Sat  Dinner     2  0.079365
237       32.83   1.17  Male    Yes   Sat  Dinner     2  0.035638
241       22.67   2.00  Male    Yes   Sat  Dinner     2  0.088222

In [47]:
grouped_pct = grouped['tip_pct']

In [49]:
for i,j in grouped_pct:
    print(i)
    print(j)

('Female', 'No')
0      0.059447
4      0.146808
11     0.141804
14     0.203641
16     0.161665
18     0.206246
21     0.135535
22     0.141408
29     0.152672
32     0.199203
33     0.118415
37     0.181335
51     0.252672
52     0.149382
57     0.056797
66     0.150152
71     0.175747
74     0.149355
82     0.181728
85     0.148435
94     0.142857
104    0.195029
111    0.137931
114    0.155581
115    0.202195
117    0.140845
118    0.144811
119    0.121262
121    0.125186
124    0.201923
125    0.140940
127    0.137741
128    0.175747
131    0.139615
132    0.134288
133    0.163132
134    0.177985
135    0.146886
136    0.193611
137    0.141343
139    0.208967
140    0.200343
143    0.184843
144    0.139988
145    0.179641
146    0.072961
147    0.137321
155    0.172194
157    0.150000
158    0.194922
162    0.123381
223    0.187735
238    0.130338
243    0.159744
Name: tip_pct, dtype: float64
('Female', 'Yes')
67     0.325733
72     0.116902
73     0.197785
92     0.173913
93     0.263480
100    0.220264
101    0.195059
102    0.056433
103    0.155219
109    0.279525
164    0.171331
168    0.152030
169    0.188147
178    0.416667
186    0.167464
188    0.192837
191    0.211509
197    0.115982
198    0.153846
201    0.157771
202    0.153846
203    0.152439
205    0.196114
209    0.174765
213    0.188395
214    0.230742
215    0.085271
219    0.102522
221    0.259314
225    0.153657
226    0.198216
229    0.130199
240    0.073584
Name: tip_pct, dtype: float64
('Male', 'No')
1      0.160542
2      0.166587
3      0.139780
5      0.186240
6      0.228050
7      0.116071
8      0.130319
9      0.218539
10     0.166504
12     0.101816
13     0.162778
15     0.181650
17     0.227747
19     0.162228
20     0.227679
23     0.192288
24     0.160444
25     0.131387
26     0.149589
27     0.157604
28     0.198157
30     0.151832
31     0.136240
34     0.183915
35     0.149626
36     0.122624
38     0.123596
39     0.159898
40     0.139651
41     0.145475
         ...
126    0.173709
129    0.095530
130    0.078616
141    0.195335
142    0.121389
148    0.176892
149    0.266312
150    0.177683
151    0.152323
152    0.158749
153    0.081466
154    0.101163
156    0.103799
159    0.121286
160    0.162791
161    0.197472
163    0.144823
165    0.141925
166    0.107900
167    0.141911
185    0.241663
195    0.190476
212    0.186220
227    0.146699
228    0.204819
232    0.291990
233    0.136490
235    0.124131
239    0.203927
242    0.098204
Name: tip_pct, dtype: float64
('Male', 'Yes')
56     0.078927
58     0.156584
60     0.158206
61     0.144823
62     0.179673
63     0.205577
69     0.139241
76     0.171875
80     0.154321
83     0.152999
90     0.103555
95     0.117750
96     0.146628
97     0.124688
98     0.142789
105    0.106771
106    0.198145
107    0.170171
138    0.125000
170    0.196812
171    0.199873
172    0.710345
173    0.099843
174    0.237812
175    0.094529
176    0.111794
177    0.138122
179    0.102512
180    0.106205
181    0.242177
182    0.077178
183    0.280535
184    0.073983
187    0.065660
189    0.173160
190    0.095602
192    0.090014
193    0.130491
194    0.241255
196    0.193424
199    0.148038
200    0.213789
204    0.194837
206    0.128244
207    0.077459
208    0.083642
210    0.066534
211    0.199305
216    0.106572
217    0.129422
218    0.186047
220    0.180921
222    0.223776
224    0.117735
230    0.083299
231    0.191205
234    0.193175
236    0.079365
237    0.035638
241    0.088222
Name: tip_pct, dtype: float64

In [51]:
grouped_pct.agg('mean')

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [52]:
grouped_pct.agg(['mean','std',peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [53]:
#to change the column names pass as a (name.function) tuple

In [54]:
grouped_pct.agg([('foo','mean'),('bar',np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [55]:
#with dataframe we have more options

In [56]:
functions = ['count','mean','max']
result = grouped['tip_pct','total_bill'].agg(functions)

In [57]:
result

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

In [58]:
result['tip_pct']

               count      mean       max
sex    smoker
Female No         54  0.156921  0.252672
       Yes        33  0.182150  0.416667
Male   No         97  0.160669  0.291990
       Yes        60  0.152771  0.710345

In [59]:
#list of tuples with custom names can also be passed

In [60]:
ftuples = [('Durchschnitt','mean'),('Abweichung',np.var)]

In [61]:
grouped['tip_pct','total_bill'].agg(ftuples)

                   tip_pct              total_bill
              Durchschnitt Abweichung Durchschnitt Abweichung
sex    smoker
Female No         0.156921   0.001327    18.105185  53.092422
       Yes        0.182150   0.005126    17.977879  84.451517
Male   No         0.160669   0.001751    19.791237  76.152961
       Yes        0.152771   0.008206    22.284500  98.244673

In [62]:
#apply different functions to different columns

In [63]:
grouped.agg({'tip':np.max,'size':'sum'})

                tip  size
sex    smoker
Female No       5.2   140
       Yes      6.5    74
Male   No       9.0   263
       Yes     10.0   150

In [64]:
grouped.agg({'tip_pct':['min','max','mean','std'],'size':'sum'})

                tip_pct                               size
                    min       max      mean       std  sum
sex    smoker
Female No      0.056797  0.252672  0.156921  0.036421  140
       Yes     0.056433  0.416667  0.182150  0.071595   74
Male   No      0.071804  0.291990  0.160669  0.041849  263
       Yes     0.035638  0.710345  0.152771  0.090588  150

In [65]:
#returning aggregated data in unindexed form

In [3]:
tips.groupby(['sex','smoker'],as_index=False).mean()

      sex smoker  total_bill       tip      size
0  Female     No   18.105185  2.773519  2.592593
1  Female    Yes   17.977879  2.931515  2.242424
2    Male     No   19.791237  3.113402  2.711340
3    Male    Yes   22.284500  3.051167  2.500000

# Group-wise Operations and Transformations

In [7]:
#add a column to a DataFrame containing group means for each index

In [6]:
df

      data1     data2 key1 key2
0  0.124734  0.225007    a  one
1 -0.716090  0.872185    a  two
2 -1.342068  0.158098    b  one
3  0.353907 -1.143855    b  two
4  1.099746  0.409517    a  one

In [8]:
#one way to do is to aggregate and then merge

In [9]:
k1_means = df.groupby('key1').mean().add_prefix('mean_')
k1_means

      mean_data1  mean_data2
key1
a       0.169463    0.502236
b      -0.494081   -0.492878

In [13]:
pd.merge(df, k1_means, left_on='key1', right_index=True)

      data1     data2 key1 key2  mean_data1  mean_data2
0  0.124734  0.225007    a  one    0.169463    0.502236
1 -0.716090  0.872185    a  two    0.169463    0.502236
4  1.099746  0.409517    a  one    0.169463    0.502236
2 -1.342068  0.158098    b  one   -0.494081   -0.492878
3  0.353907 -1.143855    b  two   -0.494081   -0.492878

In [17]:
#Adding column using transform

In [18]:
people

               a         b         c         d         e
Joe    -0.596882 -0.613971 -2.721421 -0.972023 -1.022027
Steve   0.036548  2.608573 -0.272536  0.875013 -0.270095
Wes    -0.610308 -1.554153 -0.569432  1.446204 -2.497564
Jim    -0.381635  0.069496 -0.059884 -0.894901  0.155882
Travis  1.816444  0.561435  0.952193  0.146944  1.263059

In [19]:
key = ['one', 'two', 'one', 'two', 'one']
people.groupby(key).mean()

            a         b         c         d         e
one  0.203085 -0.535563 -0.779554  0.207042 -0.752177
two -0.172544  1.339035 -0.166210 -0.009944 -0.057107

In [21]:
#transform applies a function to each group,then places the results in appropriate locations

In [20]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
Joe     0.203085 -0.535563 -0.779554  0.207042 -0.752177
Steve  -0.172544  1.339035 -0.166210 -0.009944 -0.057107
Wes     0.203085 -0.535563 -0.779554  0.207042 -0.752177
Jim    -0.172544  1.339035 -0.166210 -0.009944 -0.057107
Travis  0.203085 -0.535563 -0.779554  0.207042 -0.752177

In [22]:
#we wanted to substract the mean value from each group

In [23]:
#create a function and then pass it to transform

In [25]:
def demean(arr):
    return arr-arr.mean()

In [26]:
demeaned = people.groupby(key).transform(demean)
demeaned

               a         b         c         d         e
Joe    -0.799967 -0.078408 -1.941868 -1.179065 -0.269849
Steve   0.209092  1.269538 -0.106326  0.884957 -0.212988
Wes    -0.813393 -1.018590  0.210121  1.239162 -1.745387
Jim    -0.209092 -1.269538  0.106326 -0.884957  0.212988
Travis  1.613360  1.096998  1.731747 -0.060097  2.015236

In [27]:
demeaned.groupby(key).mean()

                a             b             c             d    e
one -7.401487e-17  7.401487e-17  7.401487e-17  9.251859e-18  0.0
two -1.387779e-17  0.000000e+00  1.387779e-17  0.000000e+00  0.0

# Apply:General split-apply-combine

In [31]:
tips.ix[:5,:]

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808
5       25.29  4.71    Male     No  Sun  Dinner     4  0.186240

In [32]:
#suppose we wanted to select the top five tip_pct values by group

In [33]:
#first method is to write a function that selects the rows with the largest values in a particular column

In [39]:
def top(df,n=5,column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [40]:
top(tips,n=5)

     total_bill   tip     sex smoker  day    time  size   tip_pct
183       23.17  6.50    Male    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39    Male     No  Sat  Dinner     2  0.291990
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

In [41]:
#now if we group by smoker and call apply with this function

In [42]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [44]:
tips.groupby(['smoker','day']).apply(top,n=1,column='total_bill')

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  94   0.142857
       Sat  212  0.186220
       Sun  156  0.103799
       Thur 142  0.121389
Yes    Fri  95   0.117750
       Sat  170  0.196812
       Sun  182  0.077178
       Thur 197  0.115982

In [45]:
#Inside groupby when we invoke describe,it is actually a shortcut for
#f = lambda x:x.describe()
#grouped.apply(f)

In [47]:
#suppresing the group keys
tips.groupby('smoker',group_keys=False).apply(top)

     total_bill   tip     sex smoker   day    time  size   tip_pct
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

# Quantile and Bucket Analysis

In [48]:
#cut function

In [49]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [50]:
frame = DataFrame({'data1':np.random.randn(1000),'data2':np.random.randn(1000)})
factor = pd.cut(frame.data1,4)

In [52]:
frame[:10]

      data1     data2
0 -1.053484 -1.286602
1  0.370266  0.540067
2 -0.833889  1.913177
3 -0.654324  0.500328
4  0.190573 -0.501388
5  0.280989 -0.524091
6  0.031784 -1.280343
7  0.279099 -0.852097
8 -1.733059 -1.146810
9  0.902699  1.363415

In [53]:
factor[:10]

0    (-1.697, -0.0968]
1     (-0.0968, 1.504]
2    (-1.697, -0.0968]
3    (-1.697, -0.0968]
4     (-0.0968, 1.504]
5     (-0.0968, 1.504]
6     (-0.0968, 1.504]
7     (-0.0968, 1.504]
8     (-3.304, -1.697]
9     (-0.0968, 1.504]
Name: data1, dtype: category
Categories (4, object): [(-3.304, -1.697] < (-1.697, -0.0968] < (-0.0968, 1.504] < (1.504, 3.104]]

In [54]:
#the factor object returned by cut can be passed directly to groupby.So we could compute a set of statistics for the 
#data2 column like so:

In [55]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),'count':group.count(),'mean':group.mean()}

In [56]:
grouped = frame.data2.groupby(factor)

In [57]:
grouped.apply(get_stats).unstack()

                   count       max      mean       min
data1
(-3.304, -1.697]    53.0  1.929419 -0.168787 -2.361773
(-1.697, -0.0968]  411.0  2.670030  0.076572 -2.925485
(-0.0968, 1.504]   463.0  2.682087  0.007251 -3.415037
(1.504, 3.104]      73.0  2.437214 -0.101446 -3.461403

In [58]:
#to compute equal size buckets

In [59]:
grouping = pd.qcut(frame.data1,10,labels =False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  1.929419 -0.058219 -2.547324
1      100.0  2.486766  0.254131 -2.925485
2      100.0  2.670030  0.046269 -2.083970
3      100.0  2.184656  0.084724 -2.069474
4      100.0  2.033503 -0.158191 -3.415037
5      100.0  2.351088 -0.062426 -2.639178
6      100.0  2.682087 -0.015425 -1.789323
7      100.0  2.304672  0.156313 -2.496147
8      100.0  2.315446  0.011505 -2.780507
9      100.0  2.437214 -0.073912 -3.461403

# Example:Filling Missing values with group specific values

In [2]:
s = Series(np.random.randn(6))

In [3]:
s[::2] = np.nan

In [4]:
s

0         NaN
1   -1.474962
2         NaN
3    0.771539
4         NaN
5    0.460818
dtype: float64

In [5]:
s.fillna(s.mean())

0   -0.080869
1   -1.474962
2   -0.080869
3    0.771539
4   -0.080869
5    0.460818
dtype: float64

In [6]:
#fill value to vary by group

In [7]:
states = ['ohio','new york','vermont','florida','oregon','nevada','california','idaho']

In [8]:
group_key = ['East'] * 4 + ['West'] * 4

In [9]:
group_key

['East', 'East', 'East', 'East', 'West', 'West', 'West', 'West']

In [10]:
data = Series(np.random.randn(8),index = states)

In [11]:
data

ohio         -0.817869
new york      0.124549
vermont      -0.895686
florida      -1.718558
oregon        0.905875
nevada        0.000062
california   -0.518153
idaho         1.016666
dtype: float64

In [12]:
data[['vermont','nevada','idaho']] = np.nan
data

ohio         -0.817869
new york      0.124549
vermont            NaN
florida      -1.718558
oregon        0.905875
nevada             NaN
california   -0.518153
idaho              NaN
dtype: float64

In [14]:
data.groupby(group_key).mean()

East   -0.803959
West    0.193861
dtype: float64

In [15]:
#we can fill the NA values using the group means like so:

In [16]:
fill_mean = lambda g: g.fillna(g.mean())

In [17]:
data.groupby(group_key).apply(fill_mean)

ohio         -0.817869
new york      0.124549
vermont      -0.803959
florida      -1.718558
oregon        0.905875
nevada        0.193861
california   -0.518153
idaho         0.193861
dtype: float64

In [19]:
for i,j in data.groupby(group_key):
    print(i)
    print(j)

East
ohio       -0.817869
new york    0.124549
vermont          NaN
florida    -1.718558
dtype: float64
West
oregon        0.905875
nevada             NaN
california   -0.518153
idaho              NaN
dtype: float64

In [20]:
#if we want to set predefined values

In [21]:
fill_values = {'East' :0.5,'West':-1}

In [25]:
fill_func = lambda g: g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

ohio         -0.817869
new york      0.124549
vermont       0.500000
florida      -1.718558
oregon        0.905875
nevada       -1.000000
california   -0.518153
idaho        -1.000000
dtype: float64

# Example:Random Sampling and Permutation

In [ ]:
#USE np.random.permutation(N)[:k] where N->total size and k(sample size)

# Example:Group Weighted Average and Correlation

In [27]:
df = DataFrame({'category':['a','a','a','a','b','b','b','b'],'data':np.random.randn(8),'weights':np.random.randn(8)})
df

  category      data   weights
0        a  0.250942 -0.344599
1        a  0.173843 -0.284082
2        a  0.174907  0.730803
3        a  0.248942 -1.555833
4        b  0.567241 -0.175226
5        b -0.393431  0.848646
6        b  1.328535 -0.048465
7        b  1.071226  0.783012

In [28]:
grouped = df.groupby('category')

In [29]:
get_wavg = lambda g:np.average(g['data'],weights=g['weights'])
grouped.apply(get_wavg)

category
a    0.271959
b    0.242276
dtype: float64

# Pivot Tables and Cross_Tabulation

In [ ]:
#A pivot table is a data summarization tool

In [31]:
tips.ix[:5,:]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4

In [32]:
#computing a table of group means arranged by sex and smoker on the rows

In [39]:
tips.pivot_table(index=['sex','smoker'])

                   size       tip  total_bill
sex    smoker
Female No      2.592593  2.773519   18.105185
       Yes     2.242424  2.931515   17.977879
Male   No      2.711340  3.113402   19.791237
       Yes     2.500000  3.051167   22.284500

In [41]:
tips.pivot_table(['tip_pct','size'],index=['sex','day'],columns='smoker')

              tip_pct                size
smoker             No       Yes        No       Yes
sex    day
Female Fri   0.165296  0.209129  2.500000  2.000000
       Sat   0.147993  0.163817  2.307692  2.200000
       Sun   0.165710  0.237075  3.071429  2.500000
       Thur  0.155971  0.163073  2.480000  2.428571
Male   Fri   0.138005  0.144730  2.000000  2.125000
       Sat   0.162132  0.139067  2.656250  2.629630
       Sun   0.158291  0.173964  2.883721  2.600000
       Thur  0.165706  0.164417  2.500000  2.300000

In [42]:
#This table could be augmented to include partial totals by passing margins= true.

In [43]:
tips.pivot_table(['tip_pct','size'],index=['sex','day'],columns='smoker',margins=True)

              tip_pct                          size
smoker             No       Yes       All        No       Yes       All
sex    day
Female Fri   0.165296  0.209129  0.199388  2.500000  2.000000  2.111111
       Sat   0.147993  0.163817  0.156470  2.307692  2.200000  2.250000
       Sun   0.165710  0.237075  0.181569  3.071429  2.500000  2.944444
       Thur  0.155971  0.163073  0.157525  2.480000  2.428571  2.468750
Male   Fri   0.138005  0.144730  0.143385  2.000000  2.125000  2.100000
       Sat   0.162132  0.139067  0.151577  2.656250  2.629630  2.644068
       Sun   0.158291  0.173964  0.162344  2.883721  2.600000  2.810345
       Thur  0.165706  0.164417  0.165276  2.500000  2.300000  2.433333
All          0.159328  0.163196  0.160803  2.668874  2.408602  2.569672

In [44]:
#to use a different agg function pass it to aggfunc

In [45]:
tips.pivot_table('tip_pct',index=['sex','smoker'],columns='day',aggfunc=len,margins=True)

day             Fri   Sat   Sun  Thur    All
sex    smoker
Female No       2.0  13.0  14.0  25.0   54.0
       Yes      7.0  15.0   4.0   7.0   33.0
Male   No       2.0  32.0  43.0  20.0   97.0
       Yes      8.0  27.0  15.0  10.0   60.0
All            19.0  87.0  76.0  62.0  244.0

In [46]:
#if some combinations are empty we would want to pass fill_value:

In [47]:
tips.pivot_table('size',index=['time','sex','smoker'],columns='day',aggfunc=sum,fill_value=0)

day                   Fri  Sat  Sun  Thur
time   sex    smoker
Dinner Female No        2   30   43     2
              Yes       8   33   10     0
       Male   No        4   85  124     0
              Yes      12   71   39     0
Lunch  Female No        3    0    0    60
              Yes       6    0    0    17
       Male   No        0    0    0    50
              Yes       5    0    0    23

# Cross-Tabulations:Crosstab

In [50]:
#A cross-tabulation is a special case of apivot table thet computes group frequencies

In [49]:
pd.crosstab(tips.sex,tips.smoker,margins=True)

smoker   No  Yes  All
sex
Female   54   33   87
Male     97   60  157
All     151   93  244

In [51]:
#the first two arguments can be either an array or Series or list of arrays

In [52]:
pd.crosstab([tips.time,tips.day],tips.smoker,margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244